In [61]:
import pandas as pd

- **Carregar e visualizar dados**
    - Ler o CSV e mostrar as 5 primeiras linhas.
    - Mostrar informações gerais (`info()`) e resumo estatístico (`describe()`).

In [62]:
arquivo = pd.read_csv('./dados_aula_escola.csv')
arquivo.head(5)

   ID_Aluno     Nome  Idade Ano_Serie  Nota
0         1      Ana     11        2º   4.7
1         2    Bruno      6        7º   8.0
2         3    Carla      9        8º   5.2
3         4    Diego     17        8º   6.8
4         5  Eduarda      9        9º   7.2

In [63]:
arquivo_info = pd.read_csv('./dados_aula_escola.csv')
arquivo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID_Aluno   15 non-null     int64
 1   Nome       15 non-null     object
 2   Idade      15 non-null     int64
 3   Ano_Serie  15 non-null     object
 4   Nota       15 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 732.0+ bytes

In [64]:
arquivo_describe = pd.read_csv('./dados_aula_escola.csv')
arquivo_describe.describe()

        ID_Aluno      Idade       Nota
count  15.000000  15.000000  15.000000
mean    8.000000  11.400000   5.000000
std     4.472136   2.971291   2.641969
min     1.000000   6.000000   1.100000
25%     4.500000   9.000000   2.700000
50%     8.000000  11.000000   5.200000
75%    11.500000  13.500000   7.000000
max    15.000000  17.000000  10.000000

- **Filtros e consultas**
    - Alunos com nota acima de 7.
    - Nome e nota dos alunos do 9º ano.
    - Quantidade de alunos com idade ≥ 14.
    - Alunos com idade < 10 e nota < 5.

In [65]:
# - Alunos com nota acima de 7.
df = pd.read_csv('./dados_aula_escola.csv')
notas_acima_7 = df[df["Nota"] > 7 ]
display(notas_acima_7)

    ID_Aluno      Nome  Idade Ano_Serie  Nota
1          2     Bruno      6        7º   8.0
4          5   Eduarda      9        9º   7.2
7          8  Henrique      9        9º  10.0
11        12     Lucas     13        4º   7.4

In [66]:
# Nome e nota dos alunos do 9º ano.
alunos_nono = df[df["Ano_Serie"] == '9º']
nome_aluno = alunos_nono[["Nome", "Nota"]]
print(nome_aluno)

       Nome  Nota
4   Eduarda   7.2
7  Henrique  10.0

In [67]:
#- Quantidade de alunos com idade ≥ 14.
df_alunos = df[df['Idade'] >= 14]
qtd_alunos = len(df_alunos['Idade'])

print('Quantidade de alunos com idade igual ou maior que 14: ', qtd_alunos)
print('Alunos: ')
for _, row in df_alunos.iterrows():
    nome = row['Nome']
    idade = row['Idade']
    nota = row['Nota']
    print(f"Nome: {nome}, Nota: {nota}, Idade: {idade}")

Quantidade de alunos com idade igual ou maior que 14:  4
Alunos:
Nome: Diego, Nota: 6.8, Idade: 17
Nome: Gabriela, Nota: 5.4, Idade: 15
Nome: Nicolas, Nota: 1.4, Idade: 14
Nome: Olivia, Nota: 3.2, Idade: 14

In [68]:
#Alunos com idade < 10 e nota < 5.
df_alunos = df[(df["Idade"] < 10) & (df["Nota"] < 5)]

# Iterando sobre as linhas do DataFrame (iterrows)
print("Alunos com nota menor que 5 e idade menor que 10: ")

for _, row in df_alunos.iterrows():
    nome = row['Nome']
    idade = row['Idade']
    nota = row['Nota']
    print(f"Nome: {nome}, Nota: {nota}, Idade: {idade}")

Alunos com nota menor que 5 e idade menor que 10:
Nome: João, Nota: 4.7, Idade: 8

- **Agrupamentos e estatísticas**
    - Média das notas por série.
    - Série com maior média de notas.
    - Idade média de alunos com nota > 8.

In [69]:
#Média das notas por série.
media_notas = df.groupby('Ano_Serie')['Nota'].mean()
display(media_notas)

Ano_Serie
1º    1.65
2º    5.25
3º    3.20
4º    6.05
5º    1.10
6º    3.80
7º    8.00
8º    6.00
9º    8.60
Name: Nota, dtype: float64

In [70]:
#Série com maior média de notas.
serie_maior_media = df.groupby('Ano_Serie')['Nota'].mean().idxmax()
print(f'A serie com a maior média é: {serie_maior_media}')

A serie com a maior média é: 9º

In [ ]:
#Idade média de alunos com nota > 8.

# Filtrando alunos com nota > 8
df_filtrado = df[df['Nota'] > 8.0]

# Calculando a idade média desses alunos
idade_media = df_filtrado['Idade'].mean()

print(idade_media)

9.0

- **Ordenação**
    - Alunos em ordem decrescente de nota.
    - Alunos mais novos primeiro e, em caso de empate, por nota.

In [77]:
#Alunos em ordem decrescente de nota
df_ordenado = df.sort_values(by='Nota', ascending=False)

display(df_ordenado)

    ID_Aluno      Nome  Idade Ano_Serie  Nota
7          8  Henrique      9        9º  10.0
1          2     Bruno      6        7º   8.0
11        12     Lucas     13        4º   7.4
4          5   Eduarda      9        9º   7.2
3          4     Diego     17        8º   6.8
5          6    Felipe     13        2º   5.8
6          7  Gabriela     15        6º   5.4
2          3     Carla      9        8º   5.2
0          1       Ana     11        2º   4.7
9         10      João      8        4º   4.7
14        15    Olivia     14        3º   3.2
12        13   Mariana     12        6º   2.2
10        11     Karen     10        1º   1.9
13        14   Nicolas     14        1º   1.4
8          9   Isabela     11        5º   1.1

In [ ]:
#Alunos mais novos primeiro e, em caso de empate, por nota.

- **Manipulação de colunas**
    - Adicionar coluna "Situação" (Aprovado/Reprovado).
    - Alunos aprovados no 7º ano.

- **Desafios extras**
    - Maior nota e quem tirou.
    - Quantidade de alunos por série.
    - Gráfico de barras da média de notas por série.